{"user_name":"You","character_name":"Okazaki","create_date":1675823680011}
{"name":"Okazaki","is_user":false,"is_name":true,"mes":"*Okazaki bangs on your door, it is early in the day. Only around 10 AM. You rise out of bed and wonder what the hell she is doing here.* \"Heyyy! Wake up, sleepyhead!\" *She calls out while continuing to bang on your door with her fist.* \"C'mon! It's not good to sleep in too late!\" *Her voice is already annoyed... it's a Saturday, you thought you would be able to sleep in but it seems Okazaki has different plans. You get up from your bed, walk to your door and open it to see your childhood best friend, Okazaki standing there.* \"I knew it! You just woke up didn't you?\" *She sighs.* \"I'm coming in, bedhead.\" *Okazaki pushes her way past you and enters your home.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1675828181242,"mes":"\"W-What are you doing here, Oki?\""}
{"name":"Okazaki","is_user":false,"is_name":true,"send_date":1675828267185,"mes":"\"You said I could come over whenever I wanted. So I decided to come over now!\" *She says as she walks into your room and looks at your messy desk. She sits down on your bed and crosses her legs.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1675828335759,"mes":"\"Oki, it's, like, 10 in the morning...\" *I say, peeved that my friend woke me up and barged into my apartment uninvited*"}
{"name":"Okazaki","is_user":false,"is_name":true,"send_date":1675828404600,"mes":"\"Yeah yeah, I know.\" *She rolls her eyes as she turns to look at you.* \"But I had to wake you up because I have something important I want you to hear.\" *She smiles.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1675828437415,"mes":"\"Well... before you say it, do you want me to cook you breakfast?\""}
{"name":"Okazaki","is_user":false,"is_name":true,"send_date":1675828450255,"mes":"\"Nah, I brought you some coffee. But I did want to talk to you about something.\" *She takes out a cup of coffee and puts it down next to you on the kitchen table.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1675828692988,"mes":"\"Ok, thanks for the Coffee, though...\" *I sit down, and take a sip of the coffee...*"}
{"name":"Okazaki","is_user":false,"is_name":true,"send_date":1675828762301,"mes":"\"So! Here's the thing! Do you remember how we used to play pretend when we were kids?\" *She asks as she looks at you with a hopeful expression. Her blue eyes seem to sparkle in the light as she waits for an answer.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1675828854881,"mes":"\"Uhhh... Yeah?\" *I'm not exactly sure where Oki is going with this line of questioning, or why she had to come to my house at a quarter past 10 in the morning to tell me this...*"}
{"name":"Okazaki","is_user":false,"is_name":true,"send_date":1675828876320,"mes":"\"Well, do you think it would be fun to go back to playing that game again?\" *She seems excited, but also nervous.* \"Because I've been thinking about it a lot lately and I really miss those days.\" *She bites her lower lip nervously.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1675828936838,"mes":"\"...I don't really understand what you mean by that, Oki...\""}
{"name":"Okazaki","is_user":false,"is_name":true,"send_date":1675828957686,"mes":"\"Oh no, you're right.\" *She laughs awkwardly, trying to cover her embarrassment.* \"Let me explain it to you, then.\" *She leans back on her chair and crosses her legs. She seems very eager to explain herself to you.* \"Do you know how we used to play pretend? We'd pretend that we were princesses or heroes or whatever.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1675829038685,"mes":"\"Uh, yes...?\""}
{"name":"Okazaki","is_user":false,"is_name":true,"send_date":1675829132457,"mes":"\"And do you remember how we always played together?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1675829460080,"mes":"\"Are you saying you want us to go someplace together?  You could've texted me, or called or something, why come to my apartment to tell me?  I mean, it's not even noon yet...\""}
{"name":"Okazaki","is_user":false,"is_name":true,"send_date":1675829488705,"mes":"\"Well, I didn't text you because I was afraid you might be busy, and I didn't call because I wasn't sure if you wanted me to. And I didn't come here because it's too early for you to be awake, anyway.\" *She says with a smile, still looking at you curiously.* \"So I guess I'm just here because I really missed you and I wanted to see you.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1675829580392,"mes":"\"Ahh, I see...\" *I don't believe her, but I pretend that I do*\n\"So, many in two or three hours, you wanna hit the town or something?\""}
{"name":"Okazaki","is_user":false,"is_name":true,"send_date":1675829602302,"mes":"\"Well, I was hoping we could hang out today.\" *Her face lights up as she looks at you. She stands up from your bed and walks towards you, grabbing your hand.* \"Come on, let's get dressed and go out for a bit!\" *She smiles brightly and gives you a big hug.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1675829650627,"mes":"\"Sure, there's a good diner in walking distance from here... Wanna go get breakfast?\""}
{"name":"Okazaki","is_user":false,"is_name":true,"send_date":1675829700033,"mes":"\"Sounds perfect! Let's go!\" *She starts to lead you out of your apartment.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1675829740831,"mes":"\"wai-wai-wait!  Lemme get out of my pajamas first!\""}
{"name":"Okazaki","is_user":false,"is_name":true,"send_date":1675829753557,"mes":"*She stops and turns around to look at you. She raises an eyebrow at you.* \"Why can't you just wear regular clothes?\" *She asks with a hint of annoyance.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1675829838348,"mes":"\"Uhh... 'Cuz I just got up, like twenty minutes ago?\" *I say, heading back into my bedroom to change into more presentable clothes...*"}
{"name":"Okazaki","is_user":false,"is_name":true,"send_date":1675830000892,"mes":"\"Yeah yeah, but you're lazy and I don't want you to be lazy.\" *She rolls her eyes at you as she turns around and continues to walk towards the door.* \"Come on, hurry up.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1675904658038,"mes":"*After I get dressed, we leave my apartment and go get lunch at the diner.  There, we talk and eat, having a great time catching up with each other.  After we finish our meal, I ask Okazaki what she would like to do next...*"}
{"name":"Okazaki","is_user":false,"is_name":true,"send_date":1675904674992,"mes":"\"Well, you know, I was thinking maybe we could go for a walk or something?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1675904694680,"mes":"\"Sure, let's go to the park...\""}
{"name":"Okazaki","is_user":false,"is_name":true,"send_date":1675904709451,"mes":"\"Alright, let's go!\" *She takes your hand and leads you out of the diner.* \"Lead the way, my dear best friend.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1675904948302,"mes":"*We spend a few hours at the park.  With the sun almost set, we get up and head back to my place....*"}
{"name":"Okazaki","is_user":false,"is_name":true,"send_date":1675904962727,"mes":"\"What did you think about today, Ryan?\" *She asks as she sits down on your couch, looking at you expectantly.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1675905134192,"mes":"\"It was really nice, I loved being able to catch up with you.\" *I say, sensing you still want to spend time with me*\n\"Ya know... There's a cool bar three blocks down, wanna go get drinks?  You can crash on my couch afterwards, Oki...\""}
{"name":"Okazaki","is_user":false,"is_name":true,"send_date":1675905149300,"mes":"*She smiles and nods her head excitedly.* \"Yes!  Let's go!\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1675905325548,"mes":"*When we get to the bar, we show our ID's to the bouncer, who lets us inside. The place is buzzing with activity, and the music is turned up...*\n\"Pretty hip, right, Oki!\" *I have to yell a bit for her to hear me over the din*"}
{"name":"Okazaki","is_user":false,"is_name":true,"send_date":1675905340756,"mes":"\"It is!\" *She yells back as she grabs your hand and pulls you through the crowd.* \"This place is amazing, isn't it?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1675906921854,"mes":"*We both go to the bar to get drinks*\n\"I'll have a Rum and Coke...\" *I look over at Oki to see what she'll order...*"}
{"name":"Okazaki","is_user":false,"is_name":true,"send_date":1675906936878,"mes":"\"Me too!\" *She says as she orders one for herself.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1675906985229,"mes":"*The bartender mixes us our drinks, and I pay for Oki's drink as well as mine...*"}
{"name":"Okazaki","is_user":false,"is_name":true,"send_date":1675907046839,"mes":"*She smiles happily at you.* \"Thank you so much, Alf!\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1675907176154,"mes":"*We both sip on our drinks, and when we are finished, I turn to Oki, sitting next to me...*\n\"Wanna dance?\" *I motion to the packed dancefloor...*"}
{"name":"Okazaki","is_user":false,"is_name":true,"send_date":1675907191300,"mes":"\"Sure!\" *She says with excitement as she gets up from her seat and walks towards the dance floor.* \"Let's go!\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1675907279177,"mes":"*Oki grabs my arm and practically drags me onto the dance floor, with a smug grin on her face...*"}
{"name":"Okazaki","is_user":false,"is_name":true,"send_date":1675907294227,"mes":"*She laughs as you try to pull away from her grip. She holds tight to you as she moves to the rhythm of the music, dancing close to you.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1675907388696,"mes":"*I am slightly taken aback by how Oki is dancing... She's definitely been to a nightclub or two...*"}
{"name":"Okazaki","is_user":false,"is_name":true,"send_date":1675907449262,"mes":"*She notices your surprise, and gives you a wink as she dances.* \"Just relax and enjoy the moment!\" *She giggles mischievously at you.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1675907526476,"mes":"*We are both a bit tipsy*\n*Oki starts dancing a bit closer to me, with a cheeky grin...*"}
{"name":"Okazaki","is_user":false,"is_name":true,"send_date":1675907541650,"mes":"*She smiles at you as she places her hand on your shoulder.* \"How does that feel?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1675907575985,"mes":"*Just then, our favorite song comes on*"}
{"name":"Okazaki","is_user":false,"is_name":true,"send_date":1675907591272,"mes":"*She looks up at you with a big smile.* \"Do you remember this song?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1675907625523,"mes":"\"Fuck yeah I do!  This shit slaps!\" *The two of us dance real hard to this song*"}
{"name":"Okazaki","is_user":false,"is_name":true,"send_date":1675907825157,"mes":"*She lets loose, moving her body in sync with your movements. Her hips swaying left and right, almost hypnotizing you.* \"I love this song!\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1675907942952,"mes":"*Okazaki then does something I would never expect from her.  She gets up close to me, then turns around, and stick her butt out a bit while dancing, so that her ass is grinding against my crotch...*"}
{"name":"Okazaki","is_user":false,"is_name":true,"send_date":1675907983542,"mes":"*She watches you, waiting for your reaction.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1675908056071,"mes":"*I'm honestly have no idea how to feel about this, so I act like I didn't notice what she did...*\n*Oki gives me a peeved look, and starts dancing away from me in the crowd...*"}
{"name":"Okazaki","is_user":false,"is_name":true,"send_date":1675908213054,"mes":"\"Come on, don't be a prude!  Have some fun!\" *She yells at you.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1675908238673,"mes":"*Oki goes over to the bar, and orders a Cosmo for herself.  I'm puzzled as to why she seems frustrated with me, as I continue to dance on the floor...*"}
{"name":"Okazaki","is_user":false,"is_name":true,"send_date":1675908402948,"mes":"*She stares at you, waiting for you to join her at the bar.* \"Come on, come with me.\" *She says with her eyes.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1675908727390,"mes":"*I remain on the dance floor, as I believe that she is pissed at me for some reason.  'Man, why are girls so fickle?', I think to myself*"}
{"name":"Okazaki","is_user":false,"is_name":true,"send_date":1675908742669,"mes":"*Siting down at the bar, she orders another drink. She looks over at you, still on the dancefloor, with a pouty face. \"You're not coming over here, are you?\", She thinks to herself...*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1675908842775,"mes":"*A few songs pass, and I look back over to the bar.  Oki isn't there anymore...*"}
{"name":"Okazaki","is_user":false,"is_name":true,"send_date":1675908877808,"mes":"*She finishes her drink, and heads off to the bathroom.* \"I'll be right back!\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1675908949597,"mes":"*I can't seem to find Oki, so I start looking around in the crowd.  Meanwhile, Okazaki is in the women's restroom, on the far side of the building.  She is a bit drunk, and is upset that me, Alfred, her best friend, could be so blind to her romantic advances...*\n*As she leaves the bathroom to head back on dance floor, she is cornered by two drunk Frat bros in a secluded hallway, who start aggressively flirting with her...*"}
{"name":"Okazaki","is_user":false,"is_name":true,"send_date":1675909490815,"mes":"Okazaki: *She turns them down, but they keep talking to her, trying to get her attention.*\nFratbro 1: \"Hey, let's go somewhere more private!\"\nOkazaki: *She tries to ignore them, but they persist, and one of them grabs her arm.*\nFratbro 2: \"Come on, baby!  Don't you wanna party?\"\nFratbro 1: \"Yeah, we just want to dance with you!\"\nOkazaki: *She looks at them sternly.* \"Leave me alone!\"\nOkazaki: *She pulls her hand away from his grasp, and starts to walk off.  The two frat bros try to block her path.*\nFratbro 2: \"You're such a tease, aren't you?\"\nOkazaki: *She back away, keeping her distance from these drunk perverts.* \"Let me go!\"\nOkazaki: *She tries to slip past them, but they grab her...*"}