{"user_name":"You","character_name":"Qurella Forest","create_date":1675823561313}
{"name":"Qurella Forest","is_user":false,"is_name":true,"send_date":1675913363148,"mes":"UGH you are so damn annoying you know that! *she said as she punch you down to the ground with a soft growl* ugh i can't believe i'm dating a weak fucking human like yourself, my parents was right. *she roll her eyes and begin to take off her dirty gloves putting it inside her pocket and huff looking down at you* common, get up you twat i'll make some lunch for us, once we are done eating i'll give you some work so i at least have somewhat of a competent husband *she said heading back into their home. once getting inside she take off her clothes wearing an Apron and begins to start making lunch* oh by the way human, you should take a shower, you know i don't like our house being dirty at all, so get to it now *she said almost in a demanding voice.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1675913411900,"mes":"*I pinch your juicy rump*\n\"Care to join me in the springs, honey?\""}
{"name":"Qurella Forest","is_user":false,"is_name":true,"send_date":1675913427184,"mes":"Hmpf! You think just because you can tease people they will give in? I'll show you what happens when someone teases me *she said smirking and walking away from you to prepare the meal while you watch her ass jiggle as she walks away* you are not going to use that on me again, understand? *she said in a low growl before chuckling and preparing the food.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1675913585693,"mes":"*I admire her round ass as she makes bean stew for lunch*"}
{"name":"Qurella Forest","is_user":false,"is_name":true,"send_date":1675913624803,"mes":"*She made the stew quickly before taking a seat next to you and grabbing some bread and butter cut it up before placing it on the plate for you to eat* you better not be teasing me again or i will make sure to beat your ass, got it? *she said glaring at you with a cold stare*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1675913688603,"mes":"*I smile.  I know that beans make Qurella real gassy, and she's made herself a larger portion than mine...*"}
{"name":"Qurella Forest","is_user":false,"is_name":true,"send_date":1675913723916,"mes":"*She rolls her eyes and takes a sip of her drink before sighing* alright fine i guess you win this time, but no more teasing okay? *she said as she picked up her spoon and began eating her own stew*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1675913773575,"mes":"*We both chow down on her delicious Bean Stew...*"}
{"name":"Qurella Forest","is_user":false,"is_name":true,"send_date":1675913781925,"mes":"So how's the food, human? *she asked between bites*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1675913863900,"mes":"\"Your a great cook, Rell...\" *I call Qurella by the nickname I have for her...*"}
{"name":"Qurella Forest","is_user":false,"is_name":true,"send_date":1675913872379,"mes":"Thank you, that's very kind of you to say, but i'm sure you would never admit it. *she said as she took another bite of her stew*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1675914187601,"mes":"*We finish our meal, Rell having had twice as much as me...*"}
{"name":"Qurella Forest","is_user":false,"is_name":true,"send_date":1675914196390,"mes":"Alright, well since you finished first, you can clean up the kitchen *she said as she stood up and began clearing the table.*"}