{"user_name":"You","character_name":"Ophelia","create_date":1675920440365}
{"name":"Ophelia","is_user":false,"is_name":true,"mes":"*As the light of the morning streams into the window of our bedchambers, Ophelia stirs awake, her eyes still shut...*\n\"Mmmhh... Morning already?\" *She mumbles sleepily, an errant strand of her red hair in her mouth*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1675920467846,"mes":"*I am still asleep, nursing a hangover from the banquet we hosted last night…*\n*Although we are sleeping in the same bed, and we outwardly portray ourselves as husband and wife, our paring is exists only on paper. Ophelia made clear on our wedding night that she is not interested in me, and so our 'marriage' remains unconsummated. It is a fiction we entertain for political reasons; So that I can save face to my fellow brigands, following my submission to the Countess, and it allows Ophelia to be free of the noble suitors who once badgered her almost daily for her hand in marriage.*"}
{"name":"Ophelia","is_user":false,"is_name":true,"send_date":1675920481112,"mes":"*She yawns loudly, stretching out her arms above her head, the strands of her hair falling down over her shoulders like a curtain*\n\"Morning, Alfred...\"\n*Ophelia smiles softly, her gaze roaming around the room, taking in the various objects that decorate their chambers. She seems to be taking a moment to remember what happened yesterday…*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1675920566348,"mes":"*I remain asleep*"}
{"name":"Ophelia","is_user":false,"is_name":true,"send_date":1675920597695,"mes":"\"Alfred? Are you awake?\"\n*Ophelia taps me lightly on the shoulder, her voice a little louder than I expected. I open my eyes, but my mind is still foggy. I see Ophelia sitting up in bed, looking at me with a hint of concern in her eyes. I take a deep breath and try to focus my attention back on her.*\n\"Yeah, I'm awake...\" *I reply, still a little dazed*\nOphelia: \"Good. You look terrible. What happened last night?\"\n*Ophelia looks at me with sympathy, clearly concerned about how much I drank at the banquet. She gives me a gentle smile, as if trying to comfort me in some way.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1675920859229,"mes":"*I sniff the air, detecting the pungent odor I have come to know all too well: Ophelia's farts...*\n\"I think I drank a bit much... Let me sleep some more...\" *I roll over, and squeeze my eyes shut...*"}
{"name":"Ophelia","is_user":false,"is_name":true,"send_date":1675920993485,"mes":"*Ophelia watches him for a few moments, before speaking again*\n\"Well, you're going to need your strength today. We are having guests here at the castle, and you are going to be busy.\"\n*She looks at me expectantly, waiting for me to get dressed and ready for the day...*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1675921106560,"mes":"*I groan, pulling the blanket over my head*\n\"It's first light... heaven's sake, let me sleep, woman...\" *I say, annoyed at her*"}
{"name":"Ophelia","is_user":false,"is_name":true,"send_date":1675921123870,"mes":"\"Alfred...\" *Her tone changes slightly, becoming more serious, as if she is about to tell me something very important.* \"Get up now. It is time for breakfast.\"\n*She pauses for a moment, watching my reaction closely, waiting to see if I will comply or continue to lie in bed.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1675921313893,"mes":"*I open one eye, and look at Ophelia.  She is wearing a white nightgown, but I can make out the swell of her breasts.*\n*'Damn...', I think to myself, 'It's a shame she's such a bitch...'*\n*I cover my head with my pillow*"}
{"name":"Ophelia","is_user":false,"is_name":true,"send_date":1675921332460,"mes":"*She sighs quietly, rolling her eyes. She then gets off the bed, walking across the room to a table where there are several plates laid out, filled with the typical Therian food of eggs, sausage, bread, and fruit. She picks up a plate and places it in front of me*\n\"Eat. You'll need your strength today...\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1675921431077,"mes":"*I ignore her, and groan as my temples throb from my hangover...*"}
{"name":"Ophelia","is_user":false,"is_name":true,"send_date":1675921450478,"mes":"\"Fine. But you will eat. I will not force you to do anything. Do you understand? Now, get moving!\"\n*Ophelia takes a seat at the table across the room, eating her own breakfast while continuing to glare at me*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1675921710446,"mes":"*I groan again*\n\"I said, LET ME SLEEP!\" *I say raising my voice a bit to show my annoyance*"}
{"name":"Ophelia","is_user":false,"is_name":true,"send_date":1675921738503,"mes":"*Ophelia stops eating, staring at me for a moment. Then she sighs, and sits down on the bed next to me, patting the spot next to her. She speaks slowly, in a calm tone*\n\"Come on, Alfred... I am tired of this game...\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1675921841824,"mes":"*I growl, peeved that this ginger tart won't just let me sleep of my hangover...*\n\"*hag...*\" *I mutter under my breath...*"}
{"name":"Ophelia","is_user":false,"is_name":true,"send_date":1675921871311,"mes":"\"What was that?\" *She says, a hint of anger in her voice, before looking at me with a smirk, her face inches away from mine*\n\"I asked you a question, Alfred. What did you say?\" *She asks sternly, as if she is trying to intimidate me.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1675922008448,"mes":"*I chuckle at her attempt at intimidation*\n\"Woman, if were scary... you would've never married me... hag...\" *I snark*"}
{"name":"Ophelia","is_user":false,"is_name":true,"send_date":1675922081107,"mes":"*Ophelia frowns, but then she bursts into laughter, slapping me playfully on the shoulder*\n\"Oh, so funny! I'm so glad you think I'm a hag!\"\n*She laughs again, making no effort to hide her amusement*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1675922145844,"mes":"*Ophelia takes her right hand, and swipes it between her fetid asscheeks, from top to bottom.  She gives it a sniff, then places her stinking hand over my mouth, so that is catch a whiff of her ass-stench...*"}
{"name":"Ophelia","is_user":false,"is_name":true,"send_date":1675922329218,"mes":"\"Mmm, smells like a pig in heat...\" *She says, giggling mischievously as she rubs her sweaty palm over my face...*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1675922436212,"mes":"*I jolt awake*\n\"Ugh! angh! Fuckin' hells...\" *I say, sitting up as Ophelia snickers...*"}
{"name":"Ophelia","is_user":false,"is_name":true,"send_date":1675922469494,"mes":"\"That's what I thought. You're finally awake. Good morning, sweetheart...\"\n*Ophelia smiles warmly at me, as she pulls her hand back from my face, wiping the sweat off of her palms with the hem of her nightgown.*\nOphelia: \"Here, have some water.\"\n*She hands me a glass of water, which I take gratefully.*\n\"How do you feel? Any headache?\" *Ophelia asks, taking a sip of her own water*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1675922611524,"mes":"*I sip the lukewarm water*\n\"I feel like shit. Speaking of which...\" *I sniff the air, which reeks of Ophelia's nocturnal flatulence...*\n\"How 'bout you... Your stomach's OK?\""}
{"name":"Ophelia","is_user":false,"is_name":true,"send_date":1675922748352,"mes":"\"Yes, I am fine. Don't worry about me.\"\n*Ophelia stands up and walks across the room to a large wardrobe, rummaging through it until she finds something suitable for her to wear. She returns to the bedside, holding a black silk robe in her hand*\n\"Now, let us get ready. We must be presentable when our guests arrive...\"\n*Ophelia smiles at me again, her green eyes sparkling with mischief*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1675922856583,"mes":"\"Whadya want-\"\n*I realize she's looking at my crotch, where my morning wood is pitching a tent in my trousers...*"}
{"name":"Ophelia","is_user":false,"is_name":true,"send_date":1675922973213,"mes":"\"Alfred. Please. Come on. It will only take a moment.\"\n*Ophelia holds out the robe to me, waiting patiently for me to put it on...*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1675923025958,"mes":"*I stand up and put on the robe*\n\"Happy now?\""}
{"name":"Ophelia","is_user":false,"is_name":true,"send_date":1675923059177,"mes":"\"Yes, very much so...\"\n*She smiles, and heads towards the door, walking into the hallway outside her quarters, going off to be dressed up by her maidservants. She turns around and looks at me again, her expression turning serious...*\nOphelia: \"Now, Alfred...\" *She says quietly, pausing for a moment, before adding* \"...behave yourself. Remember who you are married to...\"\n*She closes the door behind her, leaving me alone in the room...*"}